Project/Toir.Adaptation/src/Catalogs/торо_ТиповыеОР/торо_ТиповыеОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d2263b10-6e57-46cf-b47e-55d2a0ece65c">
  <name>торо_ТиповыеОР</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Изготовитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Направление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаборСвойствОР</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a539d3d0-780d-4225-9a49-5758a63c542a">
    <name>гкс_Модель</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>НормативныеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>УчитыватьПростоиОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Статус</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НормативныйРемонт</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособПланирования</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГрафикРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособУчетаДатыОтсчета</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеУчаствуетВПланировании</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеУчитыватьПродолжительность</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НеИспользоватьВПланированииДатуВводаВЭксплуатацию</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗамещаемыеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЗамещаемыйВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СпособЗамещения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НачальнаяГраница</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КонечнаяГраница</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>3</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запчасти</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Качество</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредшествующиеРемонты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПредшествующийВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормативныеЗатратыПриТОиР</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОграниченияНаХарактеристикиОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="3c1c3c2d-feea-4d32-8161-3307cc6b0663">
    <name>гкс_КонструктивныйСостав</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="fe3986cf-990b-463d-b2d8-8fbd42506576">
      <name>Компонент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir.Adaptation/src/Enums/торо_ТипыОбъектовRCM/торо_ТипыОбъектовRCM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c3d8e035-da50-4f13-96f3-fb3612d91d8b">
  <name>торо_ТипыОбъектовRCM</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f02e4c26-aca8-4efa-8aef-cef78c903dd7">
    <name>ФункциональноеМесто</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Catalogs/торо_ТиповыеОР/ObjectModule.bsl
#Область ОбработчикиСобытий

&После("ПриЗаписи")
Процедура Расш_гкс_ПриЗаписи(Отказ)
	Если ДополнительныеСвойства.Свойство("ТК") Тогда 
		Если ЗначениеЗаполнено(ДополнительныеСвойства.ТК) Тогда 
			Если Не ДополнительныеСвойства.ТК_Имя = ДополнительныеСвойства.ТК_ИмяНовое ИЛИ
				Не ДополнительныеСвойства.ТК_Родитель = ДополнительныеСвойства.ТК_РодительНовый Тогда 
				ОбъектТехКарта = ДополнительныеСвойства.ТК.ПолучитьОбъект();
				ОбъектТехКарта.Наименование = ДополнительныеСвойства.ТК_ИмяНовое;
				ОбъектТехКарта.Родитель = ДополнительныеСвойства.ТК_РодительНовый;
				ОбъектТехКарта.гкс_Владелец = Ссылка;
				ОбъектТехКарта.Записать();
				Если Не ОбъектТехКарта.ПометкаУдаления = ПометкаУдаления Тогда 
					ОбъектТехКарта.УстановитьПометкуУдаления(ПометкаУдаления);
				КонецЕсли;
			ИначеЕсли Не ДополнительныеСвойства.ТК_ПУ = ПометкаУдаления Тогда 
				ОбъектТехКарта = ДополнительныеСвойства.ТК.ПолучитьОбъект();
				ОбъектТехКарта.УстановитьПометкуУдаления(ПометкаУдаления);
			КонецЕсли;
		ИначеЕсли ПометкаУдаления = Ложь Тогда 
			ОбъектТехКарта = Справочники.торо_ИдентификаторыТехКарт.СоздатьГруппу();
			ОбъектТехКарта.Наименование = ДополнительныеСвойства.ТК_ИмяНовое;
			ОбъектТехКарта.Родитель = ДополнительныеСвойства.ТК_РодительНовый;
			ОбъектТехКарта.гкс_Владелец = Ссылка;
			ОбъектТехКарта.Записать();   
		КонецЕсли;
	КонецЕсли;
	гкс_ОбщегоНазначенияСервер.ОбновитьКодировкиОР(Ссылка);
КонецПроцедуры

&ИзменениеИКонтроль("ПередЗаписью")
Процедура Расш_гкс_ПередЗаписью(Отказ)
	#Удаление
	Если Не ЭтотОбъект.ЭтоГруппа Тогда
		УправлениеСвойствами.ПередЗаписьюВидаОбъекта(ЭтотОбъект, "Справочник_торо_ТиповыеОР", "НаборСвойствОР");
	КонецЕсли;
	#КонецУдаления
	#Вставка
	// Гкс-[TOIR20-300] Пономарёв С.О. от 29.12.2021. Изменено:{
	// было:
	//Если ЭтоГруппа И РольДоступна("гкс_ЗапретРедактированиеКлассовТиповыхОР") Тогда 
	// стало:	
	Если ЭтоГруппа И РольДоступна("гкс_ЗапретРедактированиеКлассовТиповыхОР") и НЕ РольДоступна("гкс_ДобавлениеТиповыхОР") Тогда 
		// } Гкс-[TOIR20-300] Пономарёв С.О. от 29.12.20211.
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Недостаточно прав';en='Not enough rights';es='No hay suficientes derechos'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	УправлениеСвойствами.ПередЗаписьюВидаОбъекта(ЭтотОбъект, "Справочник_торо_ТиповыеОР", "НаборСвойствОР");
	Если ЭтоГруппа = Ложь И ЗначениеЗаполнено(гкс_Модель) = Ложь Тогда 
		гкс_Модель = Строка(Родитель) + " / "+
			Наименование+?(ЗначениеЗаполнено(Изготовитель)," / "+
				Изготовитель,"")+?(ЗначениеЗаполнено(Комментарий)," / "+Комментарий,"");
	КонецЕсли;
	
	Если ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто Тогда 
		Направление = Неопределено;
		Изготовитель = Неопределено;
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Ограничение КАК Ограничение,
		               |	торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Иерархия КАК Иерархия
		               |ПОМЕСТИТЬ Старые
		               |ИЗ
		               |	Справочник.торо_ТиповыеОР.ОграниченияНаХарактеристикиОборудования КАК торо_ТиповыеОРОграниченияНаХарактеристикиОборудования
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТЧ.Ограничение КАК Ограничение,
		               |	ТЧ.Иерархия КАК Иерархия
		               |ПОМЕСТИТЬ Новые
		               |ИЗ
		               |	&ТЧ КАК ТЧ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Новые.Иерархия КАК Иерархия,
		               |	Старые.Иерархия КАК Иерархия1
		               |ИЗ
		               |	Старые КАК Старые
		               |		ПОЛНОЕ СОЕДИНЕНИЕ Новые КАК Новые
		               |		ПО Старые.Ограничение = Новые.Ограничение
		               |			И Старые.Иерархия = Новые.Иерархия
		               |ГДЕ
		               |	(Новые.Ограничение ЕСТЬ NULL
		               |			ИЛИ Старые.Ограничение ЕСТЬ NULL)";
		Запрос.УстановитьПараметр("ТЧ",ОграниченияНаХарактеристикиОборудования.Выгрузить());
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() = Ложь Тогда 
			НаборЗаписей = РегистрыСведений.торо_ОбъектыДляПроверкиТребованийФМ.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Ссылка);
			НоваяСтрока = НаборЗаписей.Добавить();
			НоваяСтрока.Объект = Ссылка;
			НоваяСтрока.Период = ТекущаяДата();
			НаборЗаписей.Записать();
		КонецЕсли;
	Иначе
		Если ЭтоГруппа = Ложь Тогда 
			ТипОбъекта = Перечисления.торо_ТипыОбъектовRCM.Объект;
		КонецЕсли;
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		|	торо_ТиповыеОРДополнительныеРеквизиты.Свойство КАК Свойство,
		|	торо_ТиповыеОРДополнительныеРеквизиты.Значение КАК Значение
		|ПОМЕСТИТЬ Старые
		|ИЗ
		|	Справочник.торо_ТиповыеОР.ДополнительныеРеквизиты КАК торо_ТиповыеОРДополнительныеРеквизиты
		|ГДЕ
		|	торо_ТиповыеОРДополнительныеРеквизиты.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ.Свойство КАК Свойство,
		|	ТЧ.Значение КАК Значение
		|ПОМЕСТИТЬ Новые
		|ИЗ
		|	&ТЧ КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Новые.Свойство КАК Свойство,
		|	Старые.Свойство КАК Свойство1
		|ИЗ
		|	Старые КАК Старые
		|		ПОЛНОЕ СОЕДИНЕНИЕ Новые КАК Новые
		|		ПО Старые.Свойство = Новые.Свойство
		|			И Старые.Значение = Новые.Значение
		|ГДЕ
		|	(Новые.Свойство ЕСТЬ NULL
		|			ИЛИ Старые.Свойство ЕСТЬ NULL)";
		Запрос.УстановитьПараметр("ТЧ",ДополнительныеРеквизиты.Выгрузить());
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() = Ложь Тогда 
			НаборЗаписейРегистраПроверки = РегистрыСведений.торо_ОбъектыДляПроверкиТребованийФМ.СоздатьНаборЗаписей();
			НаборЗаписейРегистраПроверки.Отбор.Объект.Установить(Ссылка);
			НоваяСтрокаНабораЗаписей = НаборЗаписейРегистраПроверки.Добавить();
			НоваяСтрокаНабораЗаписей.Объект = Ссылка;
			НоваяСтрокаНабораЗаписей.Период = ТекущаяДата();
			НаборЗаписейРегистраПроверки.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда 	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_ТиповыеОР.Родитель КАК Родитель,
			|	торо_ТехКарты.Ссылка КАК ТК,
			|	торо_ТехКарты.Родитель КАК ТК_Родитель,
			|	торо_ТехКарты.Наименование КАК ТК_Имя,
			|	торо_ТехКарты.ПометкаУдаления КАК ТК_ПУ
			|ИЗ
			|	Справочник.торо_ТиповыеОР КАК торо_ТиповыеОР
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР КАК ТОРодитель
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК ТК_Родителя
			|			ПО ТОРодитель.Ссылка = ТК_Родителя.гкс_Владелец
			|		ПО торо_ТиповыеОР.Родитель = ТОРодитель.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ИдентификаторыТехКарт КАК торо_ТехКарты
			|		ПО торо_ТиповыеОР.Ссылка = торо_ТехКарты.гкс_Владелец
			|ГДЕ
			|	торо_ТиповыеОР.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	торо_ТехКарты.Ссылка КАК ТК_РодительНовый
			|ИЗ
			|	Справочник.торо_ИдентификаторыТехКарт КАК торо_ТехКарты
			|ГДЕ
			|	торо_ТехКарты.гкс_Владелец = &Родитель";
		
		Запрос.УстановитьПараметр("Родитель", Родитель);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		ИндексРезультатаСТехкартами = 0;
		ИндексРезультатаСНовымРодителем = 1;
		Если РезультатЗапроса[ИндексРезультатаСТехкартами].Пустой() = Ложь Тогда 
			Выборка = РезультатЗапроса[ИндексРезультатаСТехкартами].Выбрать();
			Выборка.Следующий();
			СтарыйРодитель = Выборка.Родитель;
			ТК_Родитель = Выборка.ТК_Родитель;
			ТехКарта = Выборка.ТК;
			ТК_Имя = Выборка.ТК_Имя;
			ТК_ПУ = Выборка.ТК_ПУ;
		Иначе
			ТехКарта = Неопределено;
			ТК_Родитель = Неопределено;
			СтарыйРодитель = Справочники.торо_ТиповыеОР.ПустаяСсылка();
			ТК_Имя = "";
			ТК_ПУ = ПометкаУдаления;
		КонецЕсли;
		Если ЗначениеЗаполнено(Родитель) Тогда 
			Если РезультатЗапроса[ИндексРезультатаСНовымРодителем].Пустой() = Ложь Тогда 
				Выборка = РезультатЗапроса[ИндексРезультатаСНовымРодителем].Выбрать();
				Выборка.Следующий();
				ТК_РодительНовый = Выборка.ТК_РодительНовый;
			Иначе
				ТК_РодительНовый = Неопределено;
			КонецЕсли;
		Иначе
			ТК_РодительНовый = Неопределено;
		КонецЕсли;
	Иначе
		СтарыйРодитель = Справочники.торо_ТиповыеОР.ПустаяСсылка();
		ТехКарта = Неопределено;
		ТК_Родитель = Неопределено;
		ТК_Имя = "";
		ТК_ПУ = ПометкаУдаления;
		//
		Если ЗначениеЗаполнено(Родитель) Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	торо_ТехКарты.Ссылка КАК ТК_РодительНовый
				|ИЗ
				|	Справочник.торо_ИдентификаторыТехКарт КАК торо_ТехКарты
				|ГДЕ
				|	торо_ТехКарты.гкс_Владелец = &Родитель";
			
			Запрос.УстановитьПараметр("Родитель", Родитель);
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() = Ложь Тогда 
				Выборка = РезультатЗапроса.Выбрать();
				Выборка.Следующий();
				ТК_РодительНовый = Выборка.ТК_РодительНовый;
			Иначе
				ТК_РодительНовый = Неопределено;
			КонецЕсли;
		Иначе
			ТК_РодительНовый = Неопределено;
		КонецЕсли;
	КонецЕсли;
	ДополнительныеСвойства.Вставить("СтарыйРодитель",СтарыйРодитель);
	ДополнительныеСвойства.Вставить("Родитель",Родитель);
	ДополнительныеСвойства.Вставить("ТК",ТехКарта);
	ДополнительныеСвойства.Вставить("ТК_ПУ",ТК_ПУ);
	ДополнительныеСвойства.Вставить("ТК_Родитель",ТК_Родитель);
	ДополнительныеСвойства.Вставить("ТК_РодительНовый",ТК_РодительНовый);
	ДополнительныеСвойства.Вставить("ТК_Имя",ТК_Имя);
	Если ЭтоГруппа Тогда 
		ДополнительныеСвойства.Вставить("ТК_ИмяНовое",Наименование);
	Иначе
		ДополнительныеСвойства.Вставить("ТК_ИмяНовое",?(ЗначениеЗаполнено(гкс_Модель),гкс_Модель,Наименование));
	КонецЕсли;
	
	МассивКУдалению = Новый Массив();
	Для Каждого СтрокаТаблицы Из гкс_КонструктивныйСостав Цикл
		Если ЗначениеЗаполнено(СтрокаТаблицы.Компонент) = Ложь Тогда 
			МассивКУдалению.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаМассива Из МассивКУдалению Цикл
		гкс_КонструктивныйСостав.Удалить(СтрокаМассива);
	КонецЦикла;
	// Гкс+[TOIR20-169] Селимов от 12.11.2020. Добавлено:{
	Если Не ЭтоНовый() И Наименование <> Ссылка.Наименование Тогда
		гкс_УстановитьНовоеНаименованиеУТК();
	КонецЕсли;   // } Гкс-[TOIR20-169]
	#КонецВставки
КонецПроцедуры

// Гкс+[TOIR20-169] Селимов от 13.11.2020. Добавлено:{
Процедура гкс_УстановитьНовоеНаименованиеУТК()
	
	ТехКартыТиповогоОР = гкс_ОбщегоНазначенияСервер.ТехКартыТиповогоОР(Ссылка, Истина);
	
	ТехКарты = ТехКартыТиповогоОР.ТехКарты;
	ПодчиненныеТехКарты = ТехКартыТиповогоОР.ПодчиненныеТехКарты;
	Для каждого ТехКарта Из ТехКарты Цикл
		Если СтрНайти(ТехКарта.Наименование, Ссылка.Наименование) Тогда
			ТК = ТехКарта.ПолучитьОбъект();			
			ТК.Наименование = СтрЗаменить(ТК.Наименование, Ссылка.Наименование, Наименование);
			ТК.Записать();
			Если ЗначениеЗаполнено(ТК.Родитель) И СтрНайти(ТехКарта.Родитель.Наименование, Ссылка.Наименование) Тогда
				ТКРодитель = ТехКарта.Родитель.ПолучитьОбъект();
				ТКРодитель.Наименование = СтрЗаменить(ТКРодитель.Наименование, Ссылка.Наименование, Наименование);
				ТКРодитель.Записать();
			КонецЕсли; 
		КонецЕсли; 	
	КонецЦикла; 
	
КонецПроцедуры // } Гкс-[TOIR20-169]

#КонецОбласти
